export const EQUIPMENT_SHEET = 'Объекты ремонта';
export const HISTORY_SHEET = 'Ввод начальных данных';
export const ID_COLUMN = 'Идентификатор для загрузки';
export const NAME_COLUMN = 'Наименование оборудования';

export const EQUIPMENT_HEADERS = [
  'Идентификатор для загрузки',
  'Уровень 0',
  'Уровень 1',
  'Уровень 2',
  'Уровень 3',
  'Уровень 4',
  'Уровень 5',
  'Уровень 6',
  'Наименование оборудования',
  'Типовой ОР',
  'Дата ввода в эксплуатацию',
  'Дата выпуска (постройки)',
  'График работы',
  'Срок полезного использования. Месяцев',
  'Инвентарный №',
  'Комментарий',
];

export const HISTORY_HEADERS = [
  'Идентификатор для загрузки',
  'Текущее состояние',
  'Причина простоя',
  'Выполненные ремонтные работы',
  'Дата окончания ремонта',
  'Параметр наработки',
  'Ед Изм',
  'Плановая наработка',
  'Период плановой наработки',
  'Продолжительность периода',
  'Дата работы с',
  'Дата работы по',
  'Значение наработки',
  'Контролируемый показатель',
  'Ед Изм КП',
  'Дата контроля',
  'Значение КП',
];
